use_cases.tex
% Created 2021-04-24 Sat 20:25
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{leeyman}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={leeyman},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Unauthenticated User}
\label{sec:orgaf5641d}
\begin{itemize}
\item The User Loads The Page
\begin{itemize}
\item The User is prompted to enter a username
\item The Username is sent to the server
\item The Server checks to see if there is a person with that name
\item The Server sends affirmations back to the client if the name is not taken
\begin{itemize}
\item Exception: the username is taken
\item The User changes their name
\end{itemize}
\item The Server enters the user into the queue to wait for a match
\item The matchmaker makes the match between two users
\end{itemize}
\end{itemize}
\section{Authenticated User --- In Game}
\label{sec:org33edf11}
\begin{itemize}
\item The User Enters A Turn
\begin{itemize}
\item The User Receives The Current State of The Game From The Server
\item The client renders the interface using the Canvas API
\item The User Interacts with The Interface to set up the next turn
\item The User sends the data to The Server
\item The server waits for the other player, if he hasn't responded already
\item The server test-renders the data
\item The Server sends out the response
\begin{itemize}
\item If one of the players has won
\item The total state changes
\end{itemize}
\end{itemize}
\item The Client Is Sent A Ping In Game
\begin{itemize}
\item The user does not reply ping
\begin{itemize}
\item Exception: the user does reply
\item Nothing happens
\end{itemize}
\item Close the user's game in the server system and notify the other player that the other 
player has won by default
\end{itemize}
\item The User Has Won The Game
\begin{itemize}
\item The client displays a victory message
\item The user pushes a button to go to the next game
\item The user enters the matchmaking queue again
\end{itemize}
\end{itemize}
\section{Admin}
\label{sec:orga7e3492}
\begin{itemize}
\item There is a Bug or Design Flaw in The Server
\begin{itemize}
\item The server is shut down
\item The programmer makes Necessary changes are made to the front-end and the back-end
\item The server is rebooted with the necessary changes
\end{itemize}
\end{itemize}
\end{document}
